{
  "backend/main.mo": "Defines data models and access-controlled operations for user profiles, resumes, job postings, and applications in a Motoko actor.",
  "feature_evidence.json": "Lists feature definitions, related frontend files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend source files for reference.",
  "frontend/index.css": "Defines global Tailwind base styles and color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the main React application.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, and routing between major views.",
  "frontend/src/components/AppLayout.tsx": "Layout component with header, navigation tabs, and footer around the active view content.",
  "frontend/src/components/ApplicationStatusPill.tsx": "Displays application status using a styled badge mapped from status type.",
  "frontend/src/components/ApplyFlowDialog.tsx": "Dialog for editing cover letters, managing submission checklists, and marking applications as applied.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication flow, showing a login screen or loading state before granting access to children.",
  "frontend/src/components/CoverLetterEditor.tsx": "Editor for viewing and saving the user's default cover letter template.",
  "frontend/src/components/JobDetail.tsx": "Displays details for a selected job with actions for applying, deleting, and viewing application status.",
  "frontend/src/components/JobFormDialog.tsx": "Dialog form for creating a new job posting with validation and submission logic.",
  "frontend/src/components/JobsFiltersBar.tsx": "UI controls for filtering jobs by location and sorting by date or match score.",
  "frontend/src/components/JobsList.tsx": "Job list page with search, filtering, sorting, job selection, and add-job dialog handling.",
  "frontend/src/components/LocationSettings.tsx": "Form for editing and saving user location fields using resume profile hooks with validation and change tracking.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth state with loading and error recovery.",
  "frontend/src/components/MatchScoreBadge.tsx": "Displays job match score from backend, showing loading, no match, or a styled badge based on score.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal for initial user profile creation, collecting name and optional email and saving via mutation.",
  "frontend/src/components/ResumeEditor.tsx": "Editor for resume text that loads, tracks changes, and saves resume content via resume profile API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor tied to Internet Identity with automatic refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth client, identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useJobApplications.ts": "Hooks to fetch, create, update, and ensure job applications with automatic cache invalidation.",
  "frontend/src/hooks/useJobMatchScore.ts": "Fetches job match score for a job ID using the actor with conditional query execution.",
  "frontend/src/hooks/useJobPostings.ts": "Hooks for fetching, adding, and deleting job postings with backend actor integration and cache updates.",
  "frontend/src/hooks/useResumeProfile.ts": "React-query hooks to fetch, save, and format the user's resume profile and location.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to load and update the authenticated user's profile with react-query.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark mode.",
  "frontend/src/main.tsx": "App entry point setting up React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata defining state, features, and requirements for the job application app."
}